---
kind: property
id: P:Autodesk.Revit.DB.CurtainGridLine.FullCurve
source: html/6bc234da-f624-9ac2-a306-6e62cfc77945.htm
---
# Autodesk.Revit.DB.CurtainGridLine.FullCurve Property

Retrieve the geometry curve of the curtain grid line.

## Syntax (C#)
```csharp
public Curve FullCurve { get; }
```